update architecture
mermaid -> ascii art
